Documents/упПроисшествиеВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упПроисшествиеВПути</Name>
			<BasedOn>
				<xr:Item>Document.упПрохождениеТочки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упЗаявкиКВыполнению</xr:Item>
				<xr:Item>AccumulationRegister.упСостояниеПоЗаданиям</xr:Item>
				<xr:Item>AccumulationRegister.упНепереданныеДокументы</xr:Item>
				<xr:Item>InformationRegister.упПланПоЗаданиям</xr:Item>
				<xr:Item>InformationRegister.упМаршрутПоРейсу</xr:Item>
				<xr:Item>InformationRegister.упСостоянияТранспортныхСредств</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьТранспорта</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаПеревозкуГруза</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаданийНаПеревозкуГруза</xr:Item>
				<xr:Item>AccumulationRegister.упЗаданияКПланированию</xr:Item>
				<xr:Item>InformationRegister.упФактическиеМестоположенияТС</xr:Item>
				<xr:Item>InformationRegister.упСтатусыРейсов</xr:Item>
				<xr:Item>AccumulationRegister.упИнкассацияДенежныхСредств</xr:Item>
				<xr:Item>InformationRegister.упРаботыПоРейсу</xr:Item>
				<xr:Item>AccumulationRegister.упОстаткиГрузовыхМест</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПроисшествия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упДействияПриПроисшествииВПути</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТочки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСозданияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упИсточникиСозданияОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПроисшествия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСправкиДТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПовреждений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проблема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПроблемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроблемаВПути</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПроблемыВПути</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрохождениеТочки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упПрохождениеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияВУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/упИзмененияРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИзмененияРейсов</Name>
			<Comment>Фиксируется необходимость обновить данные о рейсе на мобильном клиенте</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТребуетсяОбновление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упСтатусыРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСтатусыРейсов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыРейса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненЧастично</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложенаЧастьРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПлановыеПараметрыРейса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПлановыеПараметрыРейса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОтдыхаВПути</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗонаРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоГрузовыхМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НулевойПробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОценочнаяСтоимость</Name>
					<Comment>Оценочная стоимость груза</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемоеКоличествоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеНачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановоеОкончаниеВыполненияИсходное</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнкассации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/упНепереданныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упНепереданныеДокументы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРегламентногоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыРегламентныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭкземплярДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЭкземплярыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/упПроисшествиеВПути/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.упПрохождениеТочки") Тогда
		ПрохождениеТочки 	= ДанныеЗаполнения;
		Рейс 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Рейс");
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.упРейс") Тогда
		Рейс = ДанныеЗаполнения;	
	КонецЕсли;
	
	Дата			 	= ТекущаяДатаСеанса();
	НачалоВыполнения 	= Дата;
	ОкончаниеВыполнения	= Дата + 1;
	
	Если ЗначениеЗаполнено(Рейс) Тогда
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рейс, "Организация");
	Иначе	
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	ИдентификаторТочки = Новый УникальныйИдентификатор;
	
	сткЭкипаж = упРейс.ПолучитьЭкипажРейса(Рейс);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, сткЭкипаж);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ФормируютсяДвижения	= Ложь;
	
	РеквизитыОбъекта = ДополнительныеСвойства.РеквизитыОбъекта;
	
	Если (Действие = Перечисления.упДействияПриПроисшествииВПути.ВозвратНаСклад
		ИЛИ Действие = Перечисления.упДействияПриПроисшествииВПути.ПродолжениеРейса) 
			И ЗначениеЗаполнено(Рейс) И ЗначениеЗаполнено(ПрохождениеТочки)	Тогда
		ФормируютсяДвижения = Истина;
	КонецЕсли;
	
	Если ФормируютсяДвижения Тогда
		СтрокаНомер		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеТочки, "СтрокаНомер");
		мсвДокументы 	= упПрохождениеТочки.НайтиПрохождениеБолееПозднейТочки(СтрокаНомер, Рейс);
		
		Если мсвДокументы.Количество() > 0  Тогда
			ТекстСообщения = Нстр("ru = 'Происшествие с действием ""%1"" запрещено, так как приведёт к нарушению порядка прохождения точек маршрута.
			|Что бы получить такую возможность отмените перед этим проведение следующих документов:'");
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Действие);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			
			Для каждого текДокумент Из мсвДокументы Цикл
				ТекстСообщения = "		"+текДокумент;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,текДокумент,,,Отказ);	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ И ФормируютсяДвижения Тогда
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		Задания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства,"Задания");

		Если ПолучитьФункциональнуюОпцию("упИспользуетсяАндроидКлиент") Тогда
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упИзмененияРейсов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
		КонецЕсли; 
		
		Если Действие = Перечисления.упДействияПриПроисшествииВПути.ВозвратНаСклад  Тогда
			
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСтатусыРейсов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Документ", Рейс);

			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПлановыеПараметрыРейса");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
			
			Если ПолучитьФункциональнуюОпцию("упИспользуетсяВозвратДокументовПослеИсполненияРейса") Тогда
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упНепереданныеДокументы");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
			КонецЕсли; 
			
			
			Если НЕ Задания = Неопределено Тогда
						
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упЗаданияКПланированию");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.ИсточникДанных	= Задания;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Задание", "Задание");
				Если ДополнительныеСвойства.ФормироватьПоГрузовымМестам Тогда
					ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГрузовоеМесто", "ГрузовоеМесто");
				КонецЕсли;
				
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упСостояниеПоЗаданиям");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.ИсточникДанных	= Задания;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Задание", 		 "Задание");
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГрузовоеМесто", "ГрузовоеМесто");
				
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПланПоЗаданиям");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.ИсточникДанных	= Задания;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Задание", 		 "Задание");
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГрузовоеМесто", "ГрузовоеМесто");
				
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСтатусыЗаявокНаПеревозкуГруза");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.ИсточникДанных	= упЗаданиеНаПеревозку.ПолучитьЗаявкиПоЗаданиям(Задания.ВыгрузитьКолонку("Задание"));
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Документ", "Заявка");
				
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упСтатусыЗаданийНаПеревозкуГруза");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.ИсточникДанных	= Задания;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Документ", "Задание");
				
			КонецЕсли;
			Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
				
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упФактическиеМестоположенияТС");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("ТранспортноеСредство", ТранспортноеСредство);
				
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упЗанятостьТранспорта");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Транспорт", ТранспортноеСредство);
				ЭлементБлокировки.УстановитьЗначение("Документ", Рейс);
				
			КонецЕсли; 
			
		КонецЕсли;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упРаботыПоРейсу");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упМаршрутПоРейсу");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Рейс", Рейс);
		
		Попытка
			БлокировкаДанных.Заблокировать();
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ТекстОшибки = ОписаниеОшибки();
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка,,,Отказ);
			ЗаписьЖурналаРегистрации("ОшибкаБлокировки", УровеньЖурналаРегистрации.Ошибка, ,Ссылка, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
			Возврат;
		КонецПопытки;
			
	КонецЕсли;
	
	Если НЕ Отказ И ФормируютсяДвижения Тогда
				
		РеквизитыОбъекта.Вставить("Дата" , 		ОпределитьПериодФормированияДвижений());
		РеквизитыОбъекта.Вставить("Рейс", 		Рейс);
		РеквизитыОбъекта.Вставить("АдресТочки", АдресПроисшествия);
		
		Если Действие = Перечисления.упДействияПриПроисшествииВПути.ВозвратНаСклад Тогда
			
			// Формируются движения по заданиям в случае отмены заданий.
			упПрохождениеТочки.СформироватьДвиженияПоЗаданиямНаПеревозку(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// Формируются движения по заявкам в случае отмены заданий.
			упКорректировкаМаршрута.СформироватьДвиженияЗаявкиКВыполнению(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
		КонецЕсли;
		
		// Формируется маршрут.
		упКорректировкаМаршрута.СформироватьДвижениеМаршрутПоРейсу(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		
		// Формируются работы.
		упКорректировкаМаршрута.СформироватьДвижениеРаботыПоРейсу(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		
		Если Действие = Перечисления.упДействияПриПроисшествииВПути.ВозвратНаСклад Тогда
			// Формируется пакет документов, о которых следует отчитаться после выполнения рейса.
			упПрохождениеТочки.СформироватьДвиженияНепереданныеДокументы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// Формируются движения по состояниям задания.
			упПрохождениеТочки.СформироватьДвиженияСостояниеПоЗаданиям(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// Формируется план по заданиям.
			упКорректировкаМаршрута.СформироватьДвижениеПланПоЗаданиям(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// Формируется факт инкассации денежных средств.
			упПрохождениеТочки.СформироватьДвиженияИнкассацияДенежныхСредств(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// Формируются остатки грузовых мест на хабах, в случае мультимодальной перевозки.
			упКорректировкаМаршрута.СформироватьДвижениеОстаткиГрузовыхМест(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		КонецЕсли;
		
		Движения.Записать();
		
		Если Действие = Перечисления.упДействияПриПроисшествииВПути.ВозвратНаСклад Тогда
			
			// Устанавливаются статусы рейса.
			ДополнительныеСвойства.Вставить("ДобавитьСтатус", 		Ложь);
			ДополнительныеСвойства.Вставить("РассчитыватьСтатус", 	Истина);
			ДополнительныеСвойства.Вставить("ПровестиПроверкуНаВозможныеСтатусы", 	Истина);
			упРейс.СформироватьДвижениеСтатусыРейса(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			Если ДополнительныеСвойства.Свойство("ИзменилсяСтатусРейса") Тогда
				Движения.Записать();
			КонецЕсли;
			
			// При отклонении времени прохождения точки от плана заполняется плановое окончание рейса
			упКорректировкаМаршрута.СформироватьПлановыеПараметрыРейса(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// При прохождении последней точки формируются фактические параметры рейса.
			упРейс.СформироватьФактическиеПараметрыРейса(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// При прохождении первой точки ТС переводится в состояние "В рейсе", последней - свободно.
			упРейс.СформироватьДвижениеСостояниеТС(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// При прохождении последней точки фиксируется фактическое время нахождения ТС в рейсе.
			упРейс.СформироватьДвиженияЗанятостиТранспорта(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// При прохождении последней точки фиксируется фактическое время нахождения ТС в рейсе.
			упПрохождениеТочки.СформироватьДвиженияФактическиеМестоположенияТранспорта(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// Устанавливаются статусы заданий.
			ДополнительныеСвойства.Вставить("ОчиститьЗаписиСтатусЗадания", Истина);
			упЗаданиеНаПеревозку.СформироватьДвиженияСтатусыЗаданий(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// Устанавливаются статусы заявок.
			ДополнительныеСвойства.Вставить("ОчиститьЗаписиСтатусЗаявки", Истина);
			упУправленияЗаявками.СформироватьДвиженияСтатусыЗаявок(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
			// В случае если это последняя точка маршрута, то устанавливается дата окончания рейса в путевом листе.
			упПрохождениеТочки.ЗаполнитьДатуОкончанияПутевогоЛиста(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		КонецЕсли;
		
		// При выполнении рейса на мобильном клиенте фиксируем необоходимость обновить данные по рейсу
		упКорректировкаМаршрута.СформироватьДвиженияИзмененияРейсов(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ)
							
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 

	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);
	
	Если НЕ РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Отказ = упКорректировкаМаршрута.ЗапрещеноРедактироватьМаршрутИлиРаботыРейса(ЭтотОбъект);
		Если НЕ Отказ Тогда
			СтатусРейса = упРаботаСоСтатусами.ПолучитьТекущийСтатус(Рейс);
			ТекстОшибки = "";
			Если НЕ упРаботаСоСтатусамиКлиентСервер.РазрешеноФормироватьКорректировкуРейса(СтатусРейса, РежимЗаписи)  Тогда
				ТекстОшибки = НСтр(СтрШаблон("ru = 'Запрещено проведение и отмена проведения документа, так как рейс находится в статусе ""%1""'", СтатусРейса));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РеквизитыОбъекта = Новый Структура();
	
	Если НЕ Отказ И НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Если ЗначениеЗаполнено(Рейс) И ЗначениеЗаполнено(ПрохождениеТочки) Тогда
			упКорректировкаРейсаОбъект = Неопределено;
			Если НЕ ДополнительныеСвойства.Свойство("КорректировкаРейса", упКорректировкаРейсаОбъект) Тогда
				упКорректировкаРейсаОбъект = Обработки.упКорректировкаРейса.Создать();	
				ИнициализацияКорректировкиМаршрута(упКорректировкаРейсаОбъект);
				ДополнительныеСвойства.Вставить("СтатусРейсаДоКорректировки", 	упКорректировкаРейсаОбъект.СтатусРейсаДоКорректировки);
			КонецЕсли;	
					
			сткРеквизиты = Новый Структура();
			сткРеквизиты.Вставить("Идентификатор"		, ИдентификаторТочки);
			сткРеквизиты.Вставить("НачалоВыполнения"    , НачалоВыполнения);
			сткРеквизиты.Вставить("ОкончаниеВыполнения" , ОкончаниеВыполнения);
			сткРеквизиты.Вставить("АдресВозврата"		, АдресВозврата);
			сткРеквизиты.Вставить("ПроблемаВПути"		, ПроблемаВПути);
			сткРеквизиты.Вставить("Проблема"			, Проблема);
			сткРеквизиты.Вставить("АдресПроисшествия"	, АдресПроисшествия);
			сткРеквизиты.Вставить("АдресВозврата"		, АдресВозврата);
			сткРеквизиты.Вставить("Действие"			, Действие);
			упКорректировкаРейсаОбъект.СформироватьТаблицыДвиженийДляКорректировки(ДополнительныеСвойства, Ссылка, сткРеквизиты, Отказ);
			РеквизитыОбъекта.Вставить("ВидТранспортнойУслуги", упКорректировкаРейсаОбъект.ВидТранспортнойУслуги);
		КонецЕсли; 
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РеквизитыОбъекта" , РеквизитыОбъекта);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Действие = Перечисления.упДействияПриПроисшествииВПути.ВозвратНаСклад Тогда
		
		ПроверяемыеРеквизиты.Добавить("Проблема");
		
		Если НЕ ЗначениеЗаполнено(ПрохождениеТочки) Тогда
			Отказ = Истина;
			ТекстСообщения = Нстр("ru = 'Для действия ""Возврат на склад"" должнен быть заполнен реквизит ""Прохождение точки""'");		
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ТекстСообщения = "";
			Если ОкончаниеВыполнения < НачалоВыполнения	Тогда
				Отказ = Истина;
				ТекстСообщения = Нстр("ru = 'Дата убытия из точки %1 раньше даты прибытия %2'");		
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОкончаниеВыполнения, НачалоВыполнения);
			КонецЕсли;	
			
			Если Отказ Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,"ОкончаниеВыполнения", , Отказ);	
			КонецЕсли;
		КонецЕсли; 
		
		Если НЕ Отказ Тогда
			ТекстСообщения 	= "";
			СтрокаНомер 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрохождениеТочки, "СтрокаНомер");
			упПрохождениеТочки.ПроверитьДатуПрибытияФакт(НачалоВыполнения, Рейс, СтрокаНомер, ТекстСообщения, Отказ);
			
			Если Отказ Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,"НачалоВыполнения", , Отказ);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Инициализация
//
// Параметры:
//  КорректировкаМаршрутаОбъект	 
//
Процедура ИнициализацияКорректировкиМаршрута(КорректировкаМаршрутаОбъект) Экспорт
	
	ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками = ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками");
	
	КорректировкаМаршрутаОбъект.Рейс 	= Рейс;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		КорректировкаМаршрутаОбъект.Ссылка 	= Ссылка;
		КорректировкаМаршрутаОбъект.ЗаполнитьПериодДатойДвиженийПоМаршруту();
	Иначе
		КорректировкаМаршрутаОбъект.Ссылка 	= Документы.упПроисшествиеВПути.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КорректировкаМаршрутаОбъект.Период)  Тогда
		КорректировкаМаршрутаОбъект.Период = Дата;
	КонецЕсли;
	
	сткПараметрыЗаполнения = Новый Структура();
	сткПараметрыЗаполнения.Вставить("ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками", ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками);
	КорректировкаМаршрутаОбъект.Инициализация(сткПараметрыЗаполнения);
	
КонецПроцедуры

// Функция определяет дату формирования движений
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//   Дата
//
Функция ОпределитьПериодФормированияДвижений()
	
	Если ЗначениеЗаполнено(ОкончаниеВыполнения) Тогда
		Период = ОкончаниеВыполнения;
	Иначе
		Период = Дата;
	КонецЕсли; 

	Возврат Период;
	
КонецФункции


#КонецОбласти

#КонецЕсли
